In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Decision_Tree.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
import numpy as np
df.Age = df.Age.fillna(np.mean(df.Age))

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df1 = df[['Survived','Sex','Age','Fare']]

In [7]:
df1.head()

   Survived     Sex   Age     Fare
0         0    male  22.0   7.2500
1         1  female  38.0  71.2833
2         1  female  26.0   7.9250
3         1  female  35.0  53.1000
4         0    male  35.0   8.0500

In [8]:
dummies = pd.get_dummies(df.Sex)

In [9]:
df_ = pd.concat([df1,dummies], axis = 1)

In [10]:
df_.head()

   Survived     Sex   Age     Fare  female  male
0         0    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         1  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         0    male  35.0   8.0500       0     1

In [11]:
df_.drop(['Sex','male','Fare'],axis = 1,inplace = True)
df_

     Survived        Age  female
0           0  22.000000       0
1           1  38.000000       1
2           1  26.000000       1
3           1  35.000000       1
4           0  35.000000       0
..        ...        ...     ...
886         0  27.000000       0
887         1  19.000000       1
888         0  29.699118       1
889         1  26.000000       0
890         0  32.000000       0

[891 rows x 3 columns]

In [12]:
x = df_.iloc[:,1:4]
y = df_.iloc[:,0]

In [13]:
x

           Age  female
0    22.000000       0
1    38.000000       1
2    26.000000       1
3    35.000000       1
4    35.000000       0
..         ...     ...
886  27.000000       0
887  19.000000       1
888  29.699118       1
889  26.000000       0
890  32.000000       0

[891 rows x 2 columns]

In [14]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [15]:
from sklearn.model_selection import train_test_split as tts
x_tr, x_te, y_tr, y_te = tts(x,y, test_size = 0.3, random_state =10)

In [16]:
x_tr

           Age  female
7     2.000000       0
765  51.000000       1
339  45.000000       0
374   3.000000       1
183   1.000000       0
..         ...     ...
369  24.000000       1
320  22.000000       0
527  29.699118       0
125  12.000000       0
265  36.000000       0

[623 rows x 2 columns]

In [17]:
from sklearn.tree import DecisionTreeClassifier

In [18]:
dtree = DecisionTreeClassifier(criterion = 'gini').fit(x_tr,y_tr)

In [19]:
y_te_pred = dtree.predict(x_te)

In [20]:
from sklearn.metrics import accuracy_score, r2_score, confusion_matrix

In [21]:
accuracy_score(y_te,y_te_pred)

0.75

In [22]:
r2_score(y_te,y_te_pred)

-0.09782342871117633

In [23]:
confusion_matrix(y_te,y_te_pred)

array([[152,  22],
       [ 45,  49]], dtype=int64)

In [24]:
from sklearn import tree

In [ ]:
from matplotlib import pyplot as plt
from sklearn import tree
fig = plt.figure(figsize = (50,50))

tre = tree.plot_tree(dtree, feature_names = ['Age','female'], class_names = ['0','1'], filled = True,fontsize=15)